package cn.appleye.randomcontact.common.factory;

public class StructuredPostalFactory implements IFactory{
	
	public static String[] sPostalPrefix = {
			"四川省阿坝藏族羌族自治州九寨沟县","安徽省阜阳市太和县G105","甘肃省甘南藏族自治州合作市","河南省安阳市内黄县","河北省邯郸市永年县",
			"山东省日照市莒县","河南省平顶山市鲁山县","河南省平顶山市汝州市","湖北省十堰市竹山县","陕西省榆林市神木县","青海省黄南藏族自治州河南蒙古族自治县",
			"福建省福州市福清市","四川省甘孜藏族自治州九龙县","陕西省咸阳市礼泉县X215","湖北省襄阳市南漳县","甘肃省武威市民勤县","云南省昭通市镇雄县",
			"山东省菏泽市曹县S254","河南省南阳市淅川县","四川省乐山市沙湾区","陕西省宝鸡市凤县","陕西省宝鸡市太白县","贵州省黔东南苗族侗族自治州黎平县",
			"湖北省宜昌市五峰土家族自治县","四川省达州市宣汉县","四川省凉山彝族自治州越西县S208","青海省果洛藏族自治州玛沁县","贵州省毕节市七星关区",
			"山东省淄博市桓台县G205","江西省上饶市玉山县","重庆市巫溪县","重庆市南川区","贵州省遵义市赤水市S208","陕西省商洛市镇安县","山东省德州市武城县",
			"安徽省淮北市濉溪县","青海省海北藏族自治州门源回族自治县","山东省潍坊市寒亭区X056","内蒙古自治区阿拉善盟阿拉善左旗","青海省黄南藏族自治州河南蒙古族自治县",
			"宁夏回族自治区吴忠市盐池县","山东省临沂市沂水县G22(青兰高速公路)","安徽省合肥市巢湖市","青海省果洛藏族自治州达日县","湖南省常德市鼎城区",
			"云南省昭通市威信县","云南省昆明市禄劝彝族苗族自治县","江西省上饶市德兴市","湖北省恩施土家族苗族自治州建始县G209","四川省凉山彝族自治州宁南县",
			"四川省阿坝藏族羌族自治州金川县","云南省大理白族自治州洱源县","宁夏回族自治区吴忠市同心县","广西壮族自治区桂林市资源县","江苏省泰州市兴化市Y716",
			"江苏省徐州市睢宁县","陕西省安康市宁陕县","湖南省常德市桃源县XJ55","青海省果洛藏族自治州班玛县","青海省黄南藏族自治州河南蒙古族自治县",
			"湖南省张家界市武陵源区S306","江西省九江市武宁县","湖北省恩施土家族苗族自治州宣恩县","山东省临沂市平邑县","江西省九江市瑞昌市","湖南省郴州市永兴县",
			"甘肃省张掖市民乐县","陕西省商洛市山阳县Y266","江苏省镇江市句容市","安徽省宿州市埇桥区","福建省三明市沙县","广西壮族自治区柳州市融水苗族自治县",
			"广东省韶关市乳源瑶族自治县","甘肃省陇南市徽县","内蒙古自治区鄂尔多斯市乌审旗","四川省凉山彝族自治州冕宁县","四川省绵阳市平武县",
			"湖南省株洲市攸县G72(泉南高速公路)","安徽省宣城市泾县X073","宁夏回族自治区中卫市中宁县","福建省泉州市德化县","宁夏回族自治区中卫市沙坡头区",
			"山西省晋中市昔阳县S317","内蒙古自治区阿拉善盟阿拉善左旗","贵州省黔南布依族苗族自治州罗甸县","湖南省邵阳市隆回县S219","重庆市彭水苗族土家族自治县",
			"湖南省张家界市桑植县","贵州省毕节市织金县","云南省昆明市寻甸回族彝族自治县G213","江西省吉安市永丰县","河北省邢台市内丘县胜利东路","湖北省咸宁市嘉鱼县",
			"甘肃省天水市甘谷县","陕西省咸阳市永寿县御许路","四川省乐山市金口河区","河南省周口市扶沟县","湖南省怀化市沅陵县","湖南省益阳市桃江县",
			"江苏省无锡市宜兴市S342(庆源大道)","山东省济南市市中区","福建省南平市邵武市","江苏省泰州市泰兴市电厂路","","广西壮族自治区桂林市恭城瑶族自治县",
			"内蒙古自治区阿拉善盟阿拉善左旗","山西省临汾市霍州市","山西省晋中市左权县","江苏省常州市溧阳市G25(长深高速公路)","湖北省恩施土家族苗族自治州鹤峰县",
			"山东省济南市平阴县","四川省凉山彝族自治州会理县","湖南省娄底市新化县","重庆市九龙坡区云新路","福建省莆田市涵江区X211(大江线)","陕西省汉中市洋县G108",
			"云南省丽江市宁蒗彝族自治县","贵州省六盘水市六枝特区","湖北省十堰市郧西县S338","四川省阿坝藏族羌族自治州九寨沟县","内蒙古自治区阿拉善盟阿拉善左旗",
			"河北省邯郸市涉县","江西省九江市都昌县","甘肃省平凉市庄浪县","湖北省随州市广水市红石大道","四川省乐山市犍为县人和街","江苏省连云港市东海县Y736(房张线)",
			"宁夏回族自治区银川市贺兰县阳光东大道","山西省吕梁市方山县","重庆市巫溪县","重庆市酉阳土家族苗族自治县","湖南省郴州市桂东县X003","福建省南平市建阳市X817",
			"青海省黄南藏族自治州泽库县","重庆市石柱土家族自治县","宁夏回族自治区吴忠市红寺堡区G2012(定武高速公路)","四川省内江市东兴区","湖北省宜昌市当阳市","山西省吕梁市兴县",
			"贵州省黔西南布依族苗族自治州安龙县Y547","甘肃省武威市民勤县","广西壮族自治区柳州市融水苗族自治县","陕西省榆林市神木县","四川省资阳市雁江区",
			"湖南省娄底市冷水江市S312","宁夏回族自治区中卫市海原县","江西省赣州市瑞金市","甘肃省庆阳市华池县","广西壮族自治区柳州市融安县","广西壮族自治区贺州市钟山县X707",
			"广东省河源市和平县","河南省商丘市永城市","四川省达州市宣汉县","陕西省渭南市蒲城县","四川省雅安市宝兴县","广西壮族自治区桂林市永福县","甘肃省陇南市礼县",
			"四川省宜宾市珙县","陕西省咸阳市乾县","甘肃省武威市民勤县","安徽省芜湖市繁昌县","山西省长治市沁源县","重庆市酉阳土家族苗族自治县","广东省梅州市兴宁市",
			"广西壮族自治区贺州市钟山县","青海省海南藏族自治州贵德县","河北省衡水市枣强县","河南省洛阳市洛宁县","山西省吕梁市岚县","河北省石家庄市井陉县井元公路",
			"贵州省黔西南布依族苗族自治州晴隆县G320","陕西省榆林市榆阳区","云南省曲靖市富源县","甘肃省白银市会宁县","广西壮族自治区桂林市龙胜各族自治县G321","山西省临汾市洪洞县",
			"山东省临沂市平邑县","江西省抚州市南丰县","贵州省黔南布依族苗族自治州贵定县","湖南省娄底市涟源市","湖北省黄冈市浠水县","湖南省长沙市浏阳市",
			"湖北省恩施土家族苗族自治州鹤峰县S325","福建省宁德市屏南县","四川省阿坝藏族羌族自治州若尔盖县","贵州省铜仁市印江土家族苗族自治县S304","湖南省长沙市长沙县",
			"湖北省荆州市沙市区G318","福建省莆田市仙游县","云南省大理白族自治州南涧彝族自治县公民路","甘肃省武威市古浪县","四川省凉山彝族自治州木里藏族自治县",
			"山东省潍坊市昌邑市潍峡路","广西壮族自治区桂林市永福县","云南省昆明市寻甸回族彝族自治县","四川省泸州市泸县合牛路","福建省三明市沙县","江西省抚州市乐安县",
			"安徽省滁州市凤阳县","甘肃省临夏回族自治州东乡族自治县","内蒙古自治区鄂尔多斯市鄂托克前旗","湖北省十堰市竹山县","河南省新乡市长垣县",
			"云南省大理白族自治州巍山彝族回族自治县","云南省玉溪市华宁县","四川省巴中市平昌县","湖北省随州市随县","甘肃省武威市凉州区","安徽省宿州市埇桥区双马路",
			"福建省南平市浦城县S302","湖南省怀化市辰溪县","甘肃省平凉市崇信县","贵州省遵义市汇川区G75(兰海高速公路)","甘肃省白银市靖远县","湖南省娄底市涟源市X035",
			"四川省甘孜藏族自治州理塘县","湖南省怀化市芷江侗族自治县","江西省景德镇市乐平市","河南省平顶山市鲁山县G207","四川省达州市宣汉县","陕西省铜川市印台区","江苏省淮安市洪泽县",
			"青海省海东地区互助土族自治县","山东省菏泽市单县","四川省甘孜藏族自治州新龙县","甘肃省武威市民勤县","安徽省蚌埠市怀远县X043","福建省漳州市华安县",
			"青海省黄南藏族自治州泽库县","重庆市云阳县","云南省大理白族自治州宾川县","山西省长治市壶关县S327(川荫线)","湖南省岳阳市平江县","内蒙古自治区阿拉善盟阿拉善左旗",
			"湖北省十堰市郧西县","四川省达州市开江县","安徽省池州市贵池区","甘肃省甘南藏族自治州夏河县","湖南省怀化市新晃侗族自治县","安徽省亳州市涡阳县",
			"湖南省湘西土家族苗族自治州永顺县","甘肃省甘南藏族自治州玛曲县","甘肃省武威市古浪县","陕西省宝鸡市麟游县","陕西省西安市高陵县Y287(新夹路)","四川省攀枝花市盐边县",
			"湖北省十堰市竹溪县","福建省莆田市涵江区","河南省洛阳市栾川县","湖南省怀化市沅陵县","","福建省宁德市福安市","广西壮族自治区百色市田林县","四川省阿坝藏族羌族自治州若尔盖县",
			"浙江省丽水市松阳县","湖南省永州市蓝山县","江西省九江市武宁县","江西省上饶市弋阳县","四川省绵阳市平武县锁桂路","福建省三明市沙县X742",
			"山东省菏泽市东明县S262(东兰线)","陕西省渭南市韩城市","广东省肇庆市怀集县","河南省漯河市召陵区G36(宁洛高速公路)","湖南省岳阳市华容县G56(杭瑞高速公路)",
			"重庆市酉阳土家族苗族自治县","浙江省杭州市临安市","云南省楚雄彝族自治州元谋县","湖北省荆州市江陵县","陕西省延安市延川县文高路","陕西省渭南市大荔县X311",
			"重庆市铜梁县","青海省海南藏族自治州兴海县","安徽省黄山市祁门县","山东省济宁市邹城市S345","广西壮族自治区河池市天峨县","湖北省十堰市房县S235",
			"甘肃省临夏回族自治州广河县","浙江省金华市浦江县","广西壮族自治区河池市东兰县","甘肃省甘南藏族自治州碌曲县","贵州省遵义市遵义县","山西省晋中市昔阳县",
			"山东省菏泽市曹县","安徽省合肥市肥西县","陕西省商洛市柞水县","河南省周口市淮阳县S329","浙江省衢州市江山市水张线","河南省郑州市新郑市",
			"贵州省黔西南布依族苗族自治州安龙县","湖南省郴州市北湖区","甘肃省临夏回族自治州积石山县","山西省运城市永济市","广西壮族自治区桂林市资源县","广西壮族自治区百色市乐业县",
			"江苏省泰州市兴化市李黑线唐家段","甘肃省陇南市武都区","甘肃省甘南藏族自治州玛曲县","安徽省滁州市定远县X003","甘肃省白银市靖远县","内蒙古自治区鄂尔多斯市乌审旗",
			"云南省大理白族自治州弥渡县","安徽省宿州市埇桥区","四川省凉山彝族自治州木里藏族自治县","青海省海东地区化隆回族自治县","陕西省汉中市城固县","福建省南平市顺昌县",
			"浙江省杭州市淳安县","山西省忻州市宁武县","山西省晋城市沁水县","陕西省汉中市镇巴县","宁夏回族自治区中卫市沙坡头区","山西省吕梁市兴县S218",
			"广西壮族自治区桂林市龙胜各族自治县","贵州省黔南布依族苗族自治州贵定县","甘肃省庆阳市华池县","四川省甘孜藏族自治州色达县","四川省凉山彝族自治州会理县",
			"甘肃省临夏回族自治州东乡族自治县","四川省达州市万源市","湖北省襄阳市宜城市","青海省海南藏族自治州贵南县","河南省南阳市南召县","江西省景德镇市乐平市",
			"四川省眉山市东坡区江白路","江苏省盐城市阜宁县大关南路52号-、54号-、56号","湖南省株洲市醴陵市XB23","四川省阿坝藏族羌族自治州阿坝县","重庆市南川区",
			"山东省潍坊市寿光市","河南省驻马店市上蔡县S219","湖北省襄阳市襄州区","陕西省汉中市西乡县","河南省周口市鹿邑县","湖南省怀化市芷江侗族自治县",
			"四川省甘孜藏族自治州康定县","湖南省永州市江永县","广西壮族自治区来宾市象州县","云南省大理白族自治州鹤庆县","江西省吉安市井冈山市","湖南省株洲市炎陵县",
			"陕西省咸阳市淳化县X232","浙江省金华市金东区二环南路","四川省甘孜藏族自治州新龙县","河南省濮阳市清丰县S212(政通大道)","甘肃省武威市天祝藏族自治县",
			"内蒙古自治区鄂尔多斯市鄂托克前旗","山西省太原市古交市","山西省吕梁市中阳县","山东省济宁市泗水县","四川省阿坝藏族羌族自治州阿坝县","湖北省咸宁市咸安区",
			"浙江省杭州市桐庐县大童线","浙江省丽水市莲都区和平路78号","四川省凉山彝族自治州会理县","河南省焦作市孟州市X046","重庆市南川区S312","陕西省汉中市西乡县",
			"贵州省铜仁市石阡县","贵州省黔南布依族苗族自治州平塘县","湖南省株洲市醴陵市","甘肃省张掖市民乐县","云南省丽江市玉龙纳西族自治县","湖北省荆州市沙市区潘泊湖路",
			"云南省昭通市镇雄县","四川省攀枝花市盐边县","湖南省衡阳市衡南县X014","青海省海南藏族自治州贵南县","四川省南充市仪陇县S101","宁夏回族自治区中卫市沙坡头区",
			"湖北省襄阳市枣阳市建山大道","内蒙古自治区阿拉善盟阿拉善左旗","湖南省怀化市新晃侗族自治县","陕西省榆林市榆阳区","云南省文山壮族苗族自治州广南县","甘肃省陇南市礼县",
			"陕西省安康市平利县","山西省晋中市昔阳县G207","四川省凉山彝族自治州盐源县","湖南省张家界市桑植县S305","安徽省安庆市岳西县","河南省濮阳市范县",
			"湖南省郴州市苏仙区","广西壮族自治区百色市田林县","江西省南昌市新建县","四川省凉山彝族自治州冕宁县","四川省遂宁市大英县","河南省南阳市方城县",
			"青海省果洛藏族自治州达日县","福建省龙岩市上杭县","山东省日照市东港区G1511(日兰高速公路)","贵州省黔南布依族苗族自治州三都水族自治县",
			"贵州省黔西南布依族苗族自治州普安县","安徽省马鞍山市雨山区X018","云南省大理白族自治州弥渡县","河南省平顶山市宝丰县","河南省信阳市息县","重庆市江津区S312",
			"四川省甘孜藏族自治州色达县","云南省文山壮族苗族自治州丘北县","湖南省衡阳市衡阳县","贵州省黔南布依族苗族自治州长顺县","河南省郑州市中牟县",
			"陕西省商洛市商州区G40(沪陕高速公路)","重庆市巴南区G65(包茂高速公路)","湖北省恩施土家族苗族自治州建始县G209","江西省赣州市定南县","江西省赣州市崇义县",
			"湖北省十堰市茅箭区","湖北省湖北省直辖县级行政单位仙桃市","广西壮族自治区河池市都安瑶族自治县","陕西省安康市旬阳县","甘肃省陇南市西和县","湖南省张家界市桑植县",
			"安徽省亳州市谯城区X008","广西壮族自治区来宾市象州县","四川省甘孜藏族自治州泸定县","安徽省蚌埠市五河县","河南省焦作市修武县G5512(晋新高速公路)",
			"四川省遂宁市射洪县","山东省济宁市汶上县","宁夏回族自治区中卫市海原县","广东省清远市连南瑶族自治县","湖北省恩施土家族苗族自治州巴东县S245",
			"广西壮族自治区百色市田林县","陕西省榆林市子洲县","青海省果洛藏族自治州甘德县","湖南省衡阳市常宁市","湖南省湘潭市湘乡市","湖南省永州市蓝山县",
			"贵州省遵义市绥阳县","云南省昭通市威信县","贵州省黔西南布依族苗族自治州贞丰县","云南省曲靖市陆良县","湖南省怀化市溆浦县","浙江省衢州市衢江区小湖线",
			"陕西省延安市志丹县","湖南省株洲市茶陵县G106","陕西省延安市安塞县","贵州省黔西南布依族苗族自治州册亨县","甘肃省白银市靖远县","四川省阿坝藏族羌族自治州马尔康县",
			"四川省阿坝藏族羌族自治州红原县","四川省广元市青川县","湖北省咸宁市通山县","江西省九江市瑞昌市立肇线","山西省吕梁市离石区米五线",
			"湖北省恩施土家族苗族自治州咸丰县X033","内蒙古自治区阿拉善盟阿拉善左旗","湖北省恩施土家族苗族自治州利川市","山东省德州市齐河县金能大道",
			"宁夏回族自治区吴忠市盐池县","陕西省榆林市子洲县","湖北省恩施土家族苗族自治州鹤峰县","河南省南阳市西峡县","贵州省毕节市威宁彝族回族苗族自治县S212",
			"山西省晋中市左权县","青海省黄南藏族自治州泽库县","云南省楚雄彝族自治州双柏县","四川省甘孜藏族自治州稻城县","江西省九江市德安县",
			"四川省凉山彝族自治州冕宁县","广东省梅州市兴宁市","河南省驻马店市确山县","四川省绵阳市平武县","湖南省益阳市安化县","山西省长治市壶关县","广东省韶关市乳源瑶族自治县",
			"重庆市城口县","四川省资阳市简阳市G318","青海省海东地区循化撒拉族自治县","青海省西宁市湟中县","四川省阿坝藏族羌族自治州阿坝县","陕西省汉中市留坝县",
			"四川省甘孜藏族自治州康定县","湖北省鄂州市华容区车站路","安徽省滁州市明光市","甘肃省兰州市永登县","四川省宜宾市兴文县","甘肃省兰州市皋兰县","江苏省镇江市丹阳市",
			"广东省韶关市始兴县","四川省南充市西充县","四川省阿坝藏族羌族自治州茂县","青海省西宁市湟中县","河南省三门峡市卢氏县","贵州省铜仁市德江县","重庆市奉节县",
			"山东省滨州市滨城区渤海十八路","河北省衡水市冀州市冀李线","安徽省亳州市谯城区","内蒙古自治区阿拉善盟阿拉善左旗X751","宁夏回族自治区固原市彭阳县","四川省雅安市石棉县",
			"江西省上饶市婺源县","安徽省滁州市全椒县"
	};
	
	private static String[] sRoads = {
			"重庆大厦","黑龙江路","十梅庵街","遵义路","湘潭街","瑞金广场","仙山街","仙山东路","仙山西大厦","白沙河路","赵红广场","机场路","民航街","长城南路","流亭立交桥",
			"虹桥广场","长城大厦","礼阳路","风岗街","中川路","白塔广场","兴阳路","文阳街","绣城路","河城大厦","锦城广场","崇阳街","华城路","康城街","正阳路","和阳广场","中城路",
			"江城大厦","顺城路","安城街","山城广场","春城街","国城路","泰城街","德阳路","明阳大厦","春阳路","艳阳街","秋阳路","硕阳街","青威高速","瑞阳街","丰海路","双元大厦","惜福镇街道",
			"夏庄街道","古庙工业园","中山街","太平路","广西街","潍县广场","博山大厦","湖南路","济宁街","芝罘路","易州广场","荷泽四路","荷泽二街","荷泽一路","荷泽三大厦","观海二广场",
			"广西支街","观海一路","济宁支街","莒县路","平度广场","明水路","蒙阴大厦","青岛路","湖北街","江宁广场","郯城街","天津路","保定街","安徽路","河北大厦","黄岛路","北京街",
			"莘县路","济南街","宁阳广场","日照街","德县路","新泰大厦","荷泽路","山西广场","沂水路","肥城街","兰山路","四方街","平原广场","泗水大厦","浙江路","曲阜街","寿康路","河南广场",
			"泰安路","大沽街","红山峡支路","西陵峡一大厦","台西纬一广场","台西纬四街","台西纬二路","西陵峡二街","西陵峡三路","台西纬三广场","台西纬五路","明月峡大厦","青铜峡路","台西二街",
			"观音峡广场","瞿塘峡街","团岛二路","团岛一街","台西三路","台西一大厦","郓城南路","团岛三街","刘家峡路","西藏二街","西藏一广场","台西四街","三门峡路","城武支大厦","红山峡路",
			"郓城北广场","龙羊峡路","西陵峡街","台西五路","团岛四街","石村广场","巫峡大厦","四川路","寿张街","嘉祥路","南村广场","范县路","西康街","云南路","巨野大厦","西江广场","鱼台街",
			"单县路","定陶街","滕县路","钜野广场","观城路","汶上大厦","朝城路","滋阳街","邹县广场","濮县街","磁山路","汶水街","西藏路","城武大厦","团岛路","南阳街","广州路","东平街",
			"枣庄广场","贵州街","费县路","南海大厦","登州路","文登广场","信号山支路","延安一街","信号山路","兴安支街","福山支广场","红岛支大厦","莱芜二路","吴县一街","金口三路","金口一广场",
			"伏龙山路","鱼山支街","观象二路","吴县二大厦","莱芜一广场","金口二街","海阳路","龙口街","恒山路","鱼山广场","掖县路","福山大厦","红岛路","常州街","大学广场","龙华街",
			"齐河路","莱阳街","黄县路","张店大厦","祚山路","苏州街","华山路","伏龙街","江苏广场","龙江街","王村路","琴屿大厦","齐东路","京山广场","龙山路","牟平街","延安三路","延吉街",
			"南京广场","东海东大厦","银川西路","海口街","山东路","绍兴广场","芝泉路","东海中街","宁夏路","香港西大厦","隆德广场","扬州街","郧阳路","太平角一街","宁国二支路","太平角二广场",
			"天台东一路","太平角三大厦","漳州路一路","漳州街二街","宁国一支广场","太平角六街","太平角四路","天台东二街","太平角五路","宁国三大厦","澳门三路","江西支街","澳门二路",
			"宁国四街","大尧一广场","咸阳支街","洪泽湖路","吴兴二大厦","澄海三路","天台一广场","新湛二路","三明北街","新湛支路","湛山五街","泰州三广场","湛山四大厦","闽江三路","澳门四街",
			"南海支路","吴兴三广场","三明南路","湛山二街","二轻新村镇","江南大厦","吴兴一广场","珠海二街","嘉峪关路","高邮湖街","湛山三路","澳门六广场","泰州二路","东海一大厦","天台二路",
			"微山湖街","洞庭湖广场","珠海支街","福州南路","澄海二街","泰州四路","香港中大厦","澳门五路","新湛三街","澳门一路","正阳关街","宁武关广场","闽江四街","新湛一路","宁国一大厦",
			"王家麦岛","澳门七广场","泰州一路","泰州六街","大尧二路","青大一街","闽江二广场","闽江一大厦","屏东支路","湛山一街","东海西路","徐家麦岛函谷关广场","大尧三路","晓望支街",
			"秀湛二路","逍遥三大厦","澳门九广场","泰州五街","澄海一路","澳门八街","福州北路","珠海一广场","宁国二路","临淮关大厦","燕儿岛路","紫荆关街","武胜关广场","逍遥一街","秀湛四路",
			"居庸关街","山海关路","鄱阳湖大厦","新湛路","漳州街","仙游路","花莲街","乐清广场","巢湖街","台南路","吴兴大厦","新田路","福清广场","澄海路","莆田街","海游路","镇江街","石岛广场",
			"宜兴大厦","三明路","仰口街","沛县路","漳浦广场","大麦岛","台湾街","天台路","金湖大厦","高雄广场","海江街","岳阳路","善化街","荣成路","澳门广场","武昌路","闽江大厦","台北路",
			"龙岩街","咸阳广场","宁德街","龙泉路","丽水街","海川路","彰化大厦","金田路","泰州街","太湖路","江西街","泰兴广场","青大街","金门路","南通大厦","旌德路","汇泉广场","宁国路",
			"泉州街","如东路","奉化街","鹊山广场","莲岛大厦","华严路","嘉义街","古田路","南平广场","秀湛路","长汀街","湛山路","徐州大厦","丰县广场","汕头街","新竹路",
			"黄海街","安庆路","基隆广场","韶关路","云霄大厦","新安路","仙居街","屏东广场","晓望街","海门路","珠海街","上杭路","永嘉大厦","漳平路","盐城街","新浦路","新昌街",
			"高田广场","市场三街","金乡东路","市场二大厦","上海支路","李村支广场","惠民南路","市场纬街","长安南路","陵县支街","冠县支广场","小港一大厦","市场一路","小港二街",
			"清平路","广东广场","新疆路","博平街","港通路","小港沿","福建广场","高唐街","茌平路","港青街","高密路","阳谷广场","平阴路","夏津大厦","邱县路","渤海街","恩县广场",
			"旅顺街","堂邑路","李村街","即墨路","港华大厦","港环路","馆陶街","普集路","朝阳街","甘肃广场","港夏街","港联路","陵县大厦","上海路","宝山广场","武定路","长清街",
			"长安路","惠民街","武城广场","聊城大厦","海泊路","沧口街","宁波路","胶州广场","莱州路","招远街","冠县路","六码头","金乡广场","禹城街","临清路","东阿街","吴淞路",
			"大港沿","辽宁路","棣纬二大厦","大港纬一路","贮水山支街","无棣纬一广场","大港纬三街","大港纬五路","大港纬四街","大港纬二路","无棣二大厦","吉林支路","大港四街",
			"普集支路","无棣三街","黄台支广场","大港三街","无棣一路","贮水山大厦","泰山支路","大港一广场","无棣四路","大连支街","大港二路","锦州支街","德平广场","高苑大厦",
			"长山路","乐陵街","临邑路","嫩江广场","合江路","大连街","博兴路","蒲台大厦","黄台广场","城阳街","临淄路","安邱街","临朐路","青城广场","商河路","热河大厦","济阳路",
			"承德街","淄川广场","辽北街","阳信路","益都街","松江路","流亭大厦","吉林路","恒台街","包头路","无棣街","铁山广场","锦州街","桓台路","兴安大厦","邹平路","胶东广场",
			"章丘路","丹东街","华阳路","青海街","泰山广场","周村大厦","四平路","台东西七街","台东东二路","台东东七广场","台东西二路","东五街","云门二路","芙蓉山村","延安二广场",
			"云门一街","台东四路","台东一街","台东二路","杭州支广场","内蒙古路","台东七大厦","台东六路","广饶支街","台东八广场","台东三街","四平支路","郭口东街","青海支路",
			"沈阳支大厦","菜市二路","菜市一街","北仲三路","瑞云街","滨县广场","庆祥街","万寿路","大成大厦","芙蓉路","历城广场","大名路","昌平街","平定路","长兴街",
			"浦口广场","诸城大厦","和兴路","德盛街","宁海路","威海广场","东山路","清和街","姜沟路","雒口大厦","松山广场","长春街","昆明路","顺兴街","利津路","阳明广场",
			"人和路","郭口大厦","营口路","昌邑街","孟庄广场","丰盛街","埕口路","丹阳街","汉口路","洮南大厦","桑梓路","沾化街","山口路","沈阳街","南口广场","振兴街","通化路",
			"福寺大厦","峄县路","寿光广场","曹县路","昌乐街","道口路","南九水街","台湛广场","东光大厦","驼峰路","太平山","标山路","云溪广场","太清路"
	};
	
	public static int getRandomNumber() {
		return 100 + (int)(Math.random()*100);
	}
	
	public static String createRandomSamplePostal() {
		int index = (int)(Math.random() * sPostalPrefix.length);
		String postal = sPostalPrefix[index];
		
		index = (int)(Math.random() * sRoads.length);
		
		postal += sRoads[index];
		return postal + getRandomNumber() + "号";
	}
	
	public String[] createRandomPostals(int count, boolean allowRepeat) {
		String[] postals = new String[count];
		
		for(int i=0; i<count; i++) {
			String postal= createRandomSamplePostal();
			
			postals[i] = postal;
			boolean willRepeat = false;
			if(allowRepeat && i<count-1) {
				willRepeat = (int)(Math.random()*2)==1;
			}

			if (willRepeat) {
				i++;
				postals[i] = postal;
			}
		}
		
		return postals;
	}

	@Override
	public String createFirstRandomData() {
		return createRandomSamplePostal();
	}

	@Override
	public String[] createFirstRandomData(int count, boolean repeatAllowed) {
		return createRandomPostals(count, repeatAllowed);
	}

	@Override
	public String createSecondRandomData() {
		return null;
	}
}
